linux/.local/bin/monitor-check
#!/usr/bin/env bash
# monitor-check – detect EDID-blind DisplayPort outputs
# This helper inspects an =xrandr= output (default =DisplayPort-0=) and
# tells you whether it looks “EDID-blind” (no monitor size, only 640x480
# exposed). It does *not* try to be clever with automatic fixes; it’s a
# diagnostic + ritual reminder so you don’t waste time guessing.

# Usage:

# - Check default DP:
#   #+BEGIN_EXAMPLE
#   monitor-check
#   #+END_EXAMPLE
# - Check a specific output:
#   #+BEGIN_EXAMPLE
#   monitor-check DisplayPort-1
#   #+END_EXAMPLE

# If it detects the “640x480 only, 0mm x 0mm” state, it will tell you to
# power-cycle the monitor + reseat the cable, then re-run:


# [[file:../../../tools.org::*monitor-check – detect EDID-blind DisplayPort outputs][monitor-check – detect EDID-blind DisplayPort outputs:1]]
set -euo pipefail

OUT="${1:-DisplayPort-0}"

# Ensure xrandr is available
if ! command -v xrandr >/dev/null 2>&1; then
  echo "monitor-check: xrandr not found in PATH."
  exit 1
fi

# Check that the output exists
if ! xrandr | grep -q "^${OUT} "; then
  echo "monitor-check: output '${OUT}' not found in xrandr."
  echo "Available outputs:"
  xrandr | awk '/ connected| disconnected/ {print "  -", $1, $2}'
  exit 1
fi

# Grab the header line and mode block for this output
header_line="$(xrandr | awk -v o="${OUT}" '$1 == o {print; exit}')"
mode_block="$(xrandr | sed -n "/^${OUT} /,/^$/p" | sed '1d')"

echo "monitor-check: inspecting '${OUT}'"
echo "  xrandr header: ${header_line}"

# Heuristic 1: 0mm x 0mm -> no EDID info
edid_blind=0
if printf '%s\n' "${header_line}" | grep -q ' 0mm x 0mm'; then
  edid_blind=1
fi

# Heuristic 2: check if there are any modes larger than 640x480
has_large_mode=0

while IFS= read -r line; do
  # Expect mode lines like: "   1920x1080     60.00"
  if [[ "${line}" =~ ^[[:space:]]+([0-9]+)x([0-9]+) ]]; then
    w="${BASH_REMATCH[1]}"
    h="${BASH_REMATCH[2]}"

    # Treat anything strictly larger than 640x480 as a "real" mode
    if (( w > 640 || h > 480 )); then
      has_large_mode=1
      break
    fi
  fi
done <<< "${mode_block}"

# Also detect whether 640x480 is the only mode line at all
has_640_only=0
mode_count=0

while IFS= read -r line; do
  if [[ "${line}" =~ ^[[:space:]]+([0-9]+)x([0-9]+) ]]; then
    mode_count=$((mode_count + 1))
  fi
done <<< "${mode_block}"

if (( mode_count == 1 )) && printf '%s\n' "${mode_block}" | grep -q '640x480'; then
  has_640_only=1
fi

echo

if (( edid_blind == 1 && (has_large_mode == 0 || has_640_only == 1) )); then
  echo "⚠️  ${OUT} appears to be EDID-blind:"
  echo "    - Reported size: 0mm x 0mm"
  echo "    - Exposed modes: only 640x480 fallback"
  echo
  echo "This is the classic 'monitor woke up dumb' state."
  echo
  echo "Suggested ritual:"
  echo "  1) Power the monitor OFF."
  echo "  2) Reseat the DisplayPort cable (or dock cable)."
  echo "  3) Power the monitor ON."
  echo "  4) Then run:"
  echo "       xrandr --output ${OUT} --auto"
  echo
  echo "You can re-run 'monitor-check ${OUT}' afterwards to confirm higher modes."
  exit 0
fi

if (( edid_blind == 1 )); then
  echo "⚠️  ${OUT} reports 0mm x 0mm but some larger modes are present."
  echo "    EDID might be partial or stale. If you see glitches, try:"
  echo
  echo "      xrandr --output ${OUT} --off"
  echo "      xrandr --output ${OUT} --auto"
  echo
  echo "and/or perform the power-cycle ritual as above."
elif (( has_large_mode == 0 )); then
  echo "⚠️  ${OUT} has no modes larger than 640x480, but EDID is not obviously blind."
  echo "    Modes exposed:"
  echo "${mode_block}" | sed 's/^/      /'
  echo
  echo "You may still need to power-cycle the monitor and reseat the cable."
else
  echo "✅  ${OUT} reports proper EDID and larger modes are available."
  echo
  echo "Extracted modes for ${OUT}:"
  echo "${mode_block}" | sed 's/^/    /'
  echo
  echo "You can switch with, e.g.:"
  echo "  xrandr --output ${OUT} --mode <desired_mode>"
fi
# monitor-check – detect EDID-blind DisplayPort outputs:1 ends here
